content-org/zzamboni.org
#+hugo_base_dir: ../
#+hugo_section: post
#+seq_todo: TODO DRAFT DONE

#+options: creator:t

** DONE My Hammerspoon Configuration, With Commentary          :hammerspoon:
CLOSED: [2018-01-08 Mon 13:31]
:PROPERTIES:
:EXPORT_FILE_NAME: 2018-01-08-my-hammerspoon-configuration-with-commentary
:export_hugo_custom_front_matter: :toc true :featured_image /images/hammerspoon.png :summary In my ongoing series of literate config files, I present to you my Hammerspoon configuration file.
:END:

Last update: *March 18th, 2018*

In my [[../my-elvish-configuration-with-commentary/][ongoing]] [[../my-emacs-configuration-with-commentary][series]] of [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][literate]] config files, I present to you my [[http://www.hammerspoon.org/][Hammerspoon]] configuration file. You can see the generated file at [[https://github.com/zzamboni/dot-hammerspoon/blob/master/init.lua]]. As usual, this is just a snapshot at this time, you can see the current version of my configuration [[https://github.com/zzamboni/dot-hammerspoon/blob/master/init.org][in GitHub]].

*** General variables and configuration

Global log level. Per-spoon log level can be configured in each =Install:andUse= block below.

#+begin_src lua
  hs.logger.defaultLogLevel="info"
#+end_src

I use =hyper= and =shift_hyper= as the modifiers for most of my key bindings, so I define them as variables here for easier referencing.

#+begin_src lua
  hyper = {"cmd","alt","ctrl"}
  shift_hyper = {"cmd","alt","ctrl","shift"}
#+end_src

Set up an abbreviation for =hs.drawing.color.x11= since I use it repeatedly later on.

#+begin_src lua
  col = hs.drawing.color.x11
#+end_src

Work's logo, which I use in some of my Seal shortcuts later on.

#+begin_src lua
  swisscom_logo = hs.image.imageFromPath(hs.configdir .. "/files/swisscom_logo_2x.png")
#+end_src

*** Spoon Management

Set up SpoonInstall - this is the only spoon that needs to be manually installed (it is already there if you check out this repository), all the others are installed and configured automatically.

#+begin_src lua
  hs.loadSpoon("SpoonInstall")
#+end_src

Configuration of my personal spoon repository, which contains Spoons that have not been merged in the main repo.  See the descriptions at https://zzamboni.github.io/zzSpoons/.

#+begin_src lua
  spoon.SpoonInstall.repos.zzspoons = {
    url = "https://github.com/zzamboni/zzSpoons",
    desc = "zzamboni's spoon repository",
  }
#+end_src

I prefer sync notifications, makes them easier to read.

#+begin_src lua
  spoon.SpoonInstall.use_syncinstall = true
#+end_src

This is just a shortcut to make the declarations below look more readable, i.e. =Install:andUse= instead of =spoon.SpoonInstall:andUse=.

#+begin_src lua
  Install=spoon.SpoonInstall
#+end_src

*** URL Dispatching to site-specific browsers

The [[http://www.hammerspoon.org/Spoons/URLDispatcher.html][URLDispatcher]] spoon makes it possible to open URLs with different browsers. I have created different site-specific browsers using [[https://github.com/dmarmor/epichrome][Epichrome]], which allows me to keep site-specific bookmarks, search settings, etc.

#+begin_src lua
  Install:andUse("URLDispatcher",
                 {
                   config = {
                     url_patterns = {
                       { "https?://issue.swisscom.ch", "org.epichrome.app.SwisscomJira" },
                       { "https?://issue.swisscom.com", "org.epichrome.app.SwisscomJira" },
                       { "https?://jira.swisscom.com", "org.epichrome.app.SwisscomJira" },
                       { "https?://wiki.swisscom.com", "org.epichrome.app.SwisscomWiki" },
                       { "https?://collaboration.swisscom.com", "org.epichrome.app.SwisscomCollab" },
                       { "https?://smca.swisscom.com", "org.epichrome.app.SwisscomTWP" },
                       { "https?://portal.corproot.net", "com.google.Chrome" },
                       { "https?://app.opsgenie.com", "org.epichrome.app.OpsGenie" },
                     },
                     default_handler = "com.google.Chrome"
                   },
                   start = true
                 }
  )
#+end_src

*** Window and screen manipulation

The [[http://www.hammerspoon.org/Spoons/WindowHalfsAndThirds.html][WindowHalfAndThirds]] spoon sets up multiple key bindings for manipulating the size and position of windows.

#+begin_src lua
  Install:andUse("WindowHalfsAndThirds",
                 {
                   config = {
                     use_frame_correctness = true
                   },
                   hotkeys = 'default'
                 }
  )
#+end_src

The [[http://zzamboni.org/zzSpoons/WindowScreenLeftAndRight.html][WindowScreenLeftAndRight]] spoon sets up key bindings for moving windows between multiple screens.

#+begin_src lua
  Install:andUse("WindowScreenLeftAndRight",
                 {
                   hotkeys = 'default'
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/WindowGrid.html][WindowGrid]] spoon sets up a key binding (=Hyper-g= here) to overlay a grid that allows resizing windows by specifying their opposite corners.

#+begin_src lua
  Install:andUse("WindowGrid",
                 {
                   config = { gridGeometries = { { "6x4" } } },
                   hotkeys = {show_grid = {hyper, "g"}},
                   start = true
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/ToggleScreenRotation.html][ToggleScreenRotation]] spoon sets up a key binding to rotate the external screen (the spoon can set up keys for multiple screens if needed, but by default it rotates the first external screen).

#+begin_src lua
  Install:andUse("ToggleScreenRotation",
                 {
                   hotkeys = { first = {hyper, "f15"} }
                 }
  )
#+end_src

