content/post/2018-01-08-my-hammerspoon-configuration-with-commentary.md
+++
title = "My Hammerspoon Configuration, With Commentary"
author = ["Zamboni Diego"]
date = 2018-01-08T13:31:00+01:00
tags = ["hammerspoon", "config", "howto"]
draft = false
creator = "Emacs 25.3.2 (Org mode 9.1.7 + ox-hugo)"
toc = true
featured_image = "/images/hammerspoon.png"
summary = "In my ongoing series of literate config files, I present to you my Hammerspoon configuration file."
+++

In my [ongoing](../my-elvish-configuration-with-commentary/) [series](../my-emacs-configuration-with-commentary) of [literate](http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html) config files, I present to you my [Hammerspoon](http://www.hammerspoon.org/) configuration file. You can see the generated file at <https://github.com/zzamboni/dot-hammerspoon/blob/master/init.lua>. As usual, this is just a snapshot at this time, you can see the current version of my configuration [in GitHub](https://github.com/zzamboni/dot-hammerspoon/blob/master/init.org).


## General variables and configuration {#general-variables-and-configuration}

Global log level. Per-spoon log level can be configured in each
`Install:andUse` block below.

```lua
hs.logger.defaultLogLevel="info"
```

I use `hyper` and `shift_hyper` as the modifiers for most of my key
bindings, so I define them as variables here for easier referencing.

```lua
hyper = {"cmd","alt","ctrl"}
shift_hyper = {"cmd","alt","ctrl","shift"}
```

Set up an abbreviation for `hs.drawing.color.x11` since I use it
repeatedly later on.

```lua
col = hs.drawing.color.x11
```

Work's logo, which I use in some of my Seal shortcuts later on.

```lua
swisscom_logo = hs.image.imageFromPath(hs.configdir .. "/files/swisscom_logo_2x.png")
```


## Spoon Management {#spoon-management}

Set up SpoonInstall - this is the only spoon that needs to be manually
installed (it is already there if you check out this repository), all
the others are installed and configured automatically.

```lua
hs.loadSpoon("SpoonInstall")
```

Configuration of my personal spoon repository, which contains Spoons
that have not been merged in the main repo.  See the descriptions at
<https://zzamboni.github.io/zzSpoons/>.

```lua
spoon.SpoonInstall.repos.zzspoons = {
  url = "https://github.com/zzamboni/zzSpoons",
  desc = "zzamboni's spoon repository",
}
```

I prefer sync notifications, makes them easier to read.

```lua
spoon.SpoonInstall.use_syncinstall = true
```

This is just a shortcut to make the declarations below look more
readable, i.e. `Install:andUse` instead of `spoon.SpoonInstall:andUse`.

```lua
Install=spoon.SpoonInstall
```


## URL Dispatching to site-specific browsers {#url-dispatching-to-site-specific-browsers}

The [URLDispatcher](http://www.hammerspoon.org/Spoons/URLDispatcher.html) spoon makes it possible to open URLs with different
browsers. I have created different site-specific browsers using
[Epichrome](https://github.com/dmarmor/epichrome), which allows me to keep site-specific bookmarks, search
settings, etc.

```lua
Install:andUse("URLDispatcher",
               {
                 config = {
                   url_patterns = {
                     { "https?://issue.swisscom.ch", "org.epichrome.app.SwisscomJira" },
                     { "https?://issue.swisscom.com", "org.epichrome.app.SwisscomJira" },
                     { "https?://jira.swisscom.com", "org.epichrome.app.SwisscomJira" },
                     { "https?://wiki.swisscom.com", "org.epichrome.app.SwisscomWiki" },
                     { "https?://collaboration.swisscom.com", "org.epichrome.app.SwisscomCollab" },
                     { "https?://smca.swisscom.com", "org.epichrome.app.SwisscomTWP" },
                     { "https?://portal.corproot.net", "com.google.Chrome" },
                     { "https?://app.opsgenie.com", "org.epichrome.app.OpsGenie" },
                   },
                   default_handler = "com.google.Chrome"
                 },
                 start = true
               }
)
```


## Window and screen manipulation {#window-and-screen-manipulation}

The [WindowHalfAndThirds](http://www.hammerspoon.org/Spoons/WindowHalfsAndThirds.html) spoon sets up multiple key bindings for
manipulating the size and position of windows.

```lua
Install:andUse("WindowHalfsAndThirds",
               {
                 config = {
                   use_frame_correctness = true
                 },
                 hotkeys = 'default'
               }
)
```

The [WindowScreenLeftAndRight](http://zzamboni.org/zzSpoons/WindowScreenLeftAndRight.html) spoon sets up key bindings for moving
windows between multiple screens.

```lua
Install:andUse("WindowScreenLeftAndRight",
               {
                 hotkeys = 'default'
               }
)
```

The [WindowGrid](http://www.hammerspoon.org/Spoons/WindowGrid.html) spoon sets up a key binding (`Hyper-g` here) to overlay a
grid that allows resizing windows by specifying their opposite
corners.

```lua
Install:andUse("WindowGrid",
               {
                 config = { gridGeometries = { { "6x4" } } },
                 hotkeys = {show_grid = {hyper, "g"}},
                 start = true
               }
)
```

The [ToggleScreenRotation](http://www.hammerspoon.org/Spoons/ToggleScreenRotation.html) spoon sets up a key binding to rotate the
external screen (the spoon can set up keys for multiple screens if
needed, but by default it rotates the first external screen).

```lua
Install:andUse("ToggleScreenRotation",
               {
                 hotkeys = { first = {hyper, "f15"} }
               }
)
```
