content-org/zzamboni.org
*** Organization and Productivity

The [[http://www.hammerspoon.org/Spoons/UniversalArchive.html][UniversalArchive]] spoon sets up a single key binding (=Ctrl-Cmd-a=) to archive the current item in Evernote, Mail and Outlook.

#+begin_src lua
  Install:andUse("UniversalArchive",
                 {
                   config = {
                     evernote_archive_notebook = ".Archive",
                     outlook_archive_folder = "Archive (On My Computer)",
                     archive_notifications = false
                   },
                   hotkeys = { archive = { { "ctrl", "cmd" }, "a" } }
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/SendToOmniFocus.html][SendToOmniFocus]] spoon sets up a single key binding (=Hyper-t=) to send the current item to OmniFocus from multiple applications.

#+begin_src lua
  Install:andUse("SendToOmniFocus",
                 {
                   config = {
                     quickentrydialog = false,
                     notifications = false
                   },
                   hotkeys = {
                     send_to_omnifocus = { hyper, "t" }
                   },
                   fn = function(s)
                     s:registerApplication("Swisscom Collab", { apptype = "chromeapp", itemname = "tab" })
                     s:registerApplication("Swisscom Wiki", { apptype = "chromeapp", itemname = "wiki page" })
                     s:registerApplication("Swisscom Jira", { apptype = "chromeapp", itemname = "issue" })
                   end
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/EvernoteOpenAndTag.html][EvernoteOpenAndTag]] spoon sets up some missing key bindings for note manipulation in Evernote.

#+begin_src lua
  Install:andUse("EvernoteOpenAndTag",
                 {
                   hotkeys = {
                     open_note = { hyper, "o" },
                     ["open_and_tag-+work,+swisscom"] = { hyper, "w" },
                     ["open_and_tag-+personal"] = { hyper, "p" },
                     ["tag-@zzdone"] = { hyper, "z" }
                   }
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/TextClipboardHistory.html][TextClipboardHistory]] spoon implements a clipboard history, only for text items. It is invoked with =Cmd-Shift-v=.

#+begin_src lua
  Install:andUse("TextClipboardHistory",
                 {
                   config = {
                     show_in_menubar = false,
                   },
                   hotkeys = {
                     toggle_clipboard = { { "cmd", "shift" }, "v" } },
                   start = true,
                 }
  )
#+end_src

*** System and UI

The [[https://zzamboni.github.io/zzSpoons/Hammer.html][Hammer]] spoon (get it? hehe) is a simple wrapper around some common Hamerspoon configuration variables. Note that this gets loaded from my personal repo, since it's not in the official repository.

#+begin_src lua
  Install:andUse("Hammer",
                 {
                   repo = 'zzspoons',
                   config = { auto_reload_config = false },
                   hotkeys = {
                     config_reload = {hyper, "r"},
                     toggle_console = {hyper, "y"}
                   },
                   start = true
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/Caffeine.html][Caffeine]] spoon allows preventing the display and the machine from sleeping. I use it frequently when playing music from my machine, to avoid having to unlock the screen whenever I want to change the music.

#+begin_src lua
  Install:andUse("Caffeine", {
                   start = true,
                   hotkeys = {
                     toggle = { hyper, "1" }
                   }
  })
#+end_src

The [[http://www.hammerspoon.org/Spoons/MenubarFlag.html][MenubarFlag]] spoon colorizes the menubar according to the selected keyboard language or layout (functionality inspired by [[https://pqrs.org/osx/ShowyEdge/index.html.en][ShowyEdge]]). I use English, Spanish and German, so those are the colors I have defined.

#+begin_src lua
  Install:andUse("MenubarFlag",
                 {
                   config = {
                     colors = {
                       ["U.S."] = { },
                       Spanish = {col.green, col.white, col.red},
                       German = {col.black, col.red, col.yellow},
                     }
                   },
                   start = true
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/MouseCircle.html][MouseCircle]] spoon shows a circle around the mouse pointer when triggered. I have it disabled for now because I have the macOS [[https://support.apple.com/kb/PH25507?locale=en_US&viewlocale=en_US][shake-to-grow feature]] enabled.

#+begin_src lua
  Install:andUse("MouseCircle",
                 {
                   disable = true,
                   config = {
                     color = hs.drawing.color.x11.rebeccapurple
                   },
                   hotkeys = {
                     show = { hyper, "m" }
                   }
                 }
  )
#+end_src

One of my original bits of Hammerspoon code, now made into a spoon (although I keep it disabled, since I don't really use it). The [[http://www.hammerspoon.org/Spoons/ColorPicker.html][ColorPicker]] spoon shows a menu of the available color palettes, and when you select one, it draws swatches in all the colors in that palette, covering the whole screen. You can click on any of them to copy its name to the clipboard, or cmd-click to copy its RGB code.

#+begin_src lua
  Install:andUse("ColorPicker",
                 {
                   disable = true,
                   hotkeys = {
                     show = { shift_hyper, "c" }
                   },
                   config = {
                     show_in_menubar = false,
                   },
                   start = true,
                 }
  )
#+end_src

I use Homebrew, and when I run =brew update=, I often wonder about what some of the formulas shown are (names are not always obvious). The [[http://www.hammerspoon.org/Spoons/BrewInfo.html][BrewInfo]] spoon allows me to point at a Formula or Cask name and press =Hyper-b= or =Hyper-c= (for Casks) to have the output of the =info= command in a popup window, or the same key with =Shift-Hyper= to open the URL of the Formula/Cask.

#+begin_src lua
  Install:andUse("BrewInfo",
                 {
                   config = {
                     brew_info_style = {
                       textFont = "Inconsolata",
                       textSize = 14,
                       radius = 10 }
                   },
                   hotkeys = {
                     -- brew info
                     show_brew_info = {hyper, "b"},
                     open_brew_url = {shift_hyper, "b"},
                     -- brew cask info
                     show_brew_cask_info = {hyper, "c"},
                     open_brew_cask_url = {shift_hyper, "c"},
                   }
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/KSheet.html][KSheet]] spoon traverses the current application's menus and builds a cheatsheet of the keyboard shortcuts, showing it in a nice popup window.

#+begin_src lua
  Install:andUse("KSheet",
                 {
                   hotkeys = {
                     toggle = { hyper, "/" }
  }})
#+end_src

The [[http://www.hammerspoon.org/Spoons/TimeMachineProgress.html][TimeMachineProgress]] spoon shows an indicator about the progress of the ongoing Time Machine backup. The indicator disappears when there is no backup going on.

#+begin_src lua
  Install:andUse("TimeMachineProgress",
                 {
                   start = true
                 }
  )
#+end_src

