content-org/zzamboni.org
*** Other applications

The [[http://www.hammerspoon.org/Spoons/ToggleSkypeMute.html][ToggleSkypeMute]] spoon sets up the missing keyboard bindings for toggling the mute button on Skype and Skype for Business. I'm not fully happy with this spoon - it should auto-detect the application instead of having separate keys for each application, and it could be extended to more generic use.

#+begin_src lua
  Install:andUse("ToggleSkypeMute",
                 {
                   hotkeys = {
                     toggle_skype = { shift_hyper, "v" },
                     toggle_skype_for_business = { shift_hyper, "f" }
                   }
                 }
  )
#+end_src

The [[http://www.hammerspoon.org/Spoons/HeadphoneAutoPause.html][HeadphoneAutoPause]] spoon implements auto-pause/resume for iTunes, Spotify and others when the headphones are unplugged.

#+begin_src lua
  Install:andUse("HeadphoneAutoPause",
                 {
                   start = true
                 }
  )
#+end_src

*** Seal

The [[http://www.hammerspoon.org/Spoons/Seal.html][Seal]] spoon is a powerhouse - it implements a Spotlight-like launcher, but which allows for infinite configurability of what can be done or searched from the launcher window. I use Seal as my default launcher, triggered with =Cmd-space=, although I still keep Spotlight around under =Hyper-space=, mainly for its search capabilities.

We start by loading the spoon, and specifying which plugins we want.

#+begin_src lua :noweb no-export
  Install:andUse("Seal",
                 {
                   hotkeys = { show = { {"cmd"}, "space" } },
                   fn = function(s)
                     s:loadPlugins({"apps", "calc", "safari_bookmarks", "screencapture", "useractions"})
                     s.plugins.safari_bookmarks.always_open_with_safari = false
                     s.plugins.useractions.actions =
                       {
                        <<useraction-definitions>>
                       }
                     s:refreshAllCommands()
                   end,
                   start = true,
                 }
  )
#+end_src

The =useractions= Seal plugin allows me to define my own shortcuts. For example, a bookmark to the Hammerspoon documentation page:

#+begin_src lua :tangle no :noweb-ref useraction-definitions
  ["Hammerspoon docs webpage"] = {
    url = "http://hammerspoon.org/docs/",
    icon = hs.image.imageFromName(hs.image.systemImageNames.ApplicationIcon),
  },
#+end_src

Or to manually trigger my work/non-work transition scripts (see below):

#+begin_src lua :tangle no :noweb-ref useraction-definitions
  ["Leave corpnet"] = {
    fn = function()
      spoon.WiFiTransitions:processTransition('foo', 'corpnet01')
    end,
    icon = swisscom_logo,
  },
  ["Arrive in corpnet"] = {
    fn = function()
      spoon.WiFiTransitions:processTransition('corpnet01', 'foo')
    end,
    icon = swisscom_logo,
  },
#+end_src

Or to translate things using [[https://dict.leo.org/][dict.leo.org]]:

#+begin_src lua :tangle no :noweb-ref useraction-definitions
  ["Translate using Leo"] = {
    url = "http://dict.leo.org/ende/index_de.html#/search=${query}",
    icon = 'favicon',
    keyword = "leo",
  }
#+end_src

*** Network transitions

The [[http://www.hammerspoon.org/Spoons/WiFiTransitions.html][WiFiTransitions]] spoon allows triggering arbitrary actions when the SSID changes. I am interested in the change from my work network (corpnet01) to other networks, mainly because at work I need a proxy for all connections to the Internet. I have two applications which don't handle these transitions gracefully on their own: Spotify and Adium. So I have written a couple of functions for helping them along.

The =reconfigSpotifyProxy= function quits Spotify, updates the proxy settings in its config file, and restarts it.

#+begin_src lua
  function reconfigSpotifyProxy(proxy)
    local spotify = hs.appfinder.appFromName("Spotify")
    local lastapp = nil
    if spotify then
      lastapp = hs.application.frontmostApplication()
      spotify:kill()
      hs.timer.usleep(40000)
    end
    --   hs.notify.show(string.format("Reconfiguring %sSpotify", ((spotify~=nil) and "and restarting " or "")), string.format("Proxy %s", (proxy and "enabled" or "disabled")), "")
    -- I use CFEngine to reconfigure the Spotify preferences
    cmd = string.format("/usr/local/bin/cf-agent -K -f %s/files/spotify-proxymode.cf%s", hs.configdir, (proxy and " -DPROXY" or " -DNOPROXY"))
    output, status, t, rc = hs.execute(cmd)
    if spotify and lastapp then
      hs.timer.doAfter(3,
                       function()
                         if not hs.application.launchOrFocus("Spotify") then
                           hs.notify.show("Error launching Spotify", "", "")
                         end
                         if lastapp then
                           hs.timer.doAfter(0.5, hs.fnutils.partial(lastapp.activate, lastapp))
                         end
      end)
    end
  end
#+end_src

The =reconfigAdiumProxy= function uses AppleScript to tell Adium about the change without having to restart it.

#+begin_src lua
  function reconfigAdiumProxy(proxy)
    --   hs.notify.show("Reconfiguring Adium", string.format("Proxy %s", (proxy and "enabled" or "disabled")), "")
    local script = string.format([[
  tell application "Adium"
    repeat with a in accounts
      if (enabled of a) is true then
        set proxy enabled of a to %s
      end if
    end repeat
    go offline
    go online
  end tell
  ]], hs.inspect(proxy))
    hs.osascript.applescript(script)
  end
#+end_src

The configuration for the WiFiTransitions spoon invoked these functions with the appropriate parameters.

#+begin_src lua
  Install:andUse("WiFiTransitions",
                 {
                   config = {
                     actions = {
                       -- { -- Test action just to see the SSID transitions
                       --    fn = function(_, _, prev_ssid, new_ssid)
                       --       hs.notify.show("SSID change", string.format("From '%s' to '%s'", prev_ssid, new_ssid), "")
                       --    end
                       -- },
                       { -- Enable proxy in Spotify and Adium config when joining corp network
                         to = "corpnet01",
                         fn = {hs.fnutils.partial(reconfigSpotifyProxy, true),
                               hs.fnutils.partial(reconfigAdiumProxy, true),
                         }
                       },
                       { -- Disable proxy in Spotify and Adium config when leaving corp network
                         from = "corpnet01",
                         fn = {hs.fnutils.partial(reconfigSpotifyProxy, false),
                               hs.fnutils.partial(reconfigAdiumProxy, false),
                         }
                       },
                     }
                   },
                   start = true,
                 }
  )
#+end_src

*** Pop-up translation

I live in Switzerland, and my German is far from perfect, so the [[http://www.hammerspoon.org/Spoons/PopupTranslateSelection.html][PopupTranslateSelection]] spoon helps me a lot. It allows me to select some text and, with a keystroke, translate it to any of three languages using Google Translate. Super useful! Usually, Google's auto-detect feature works fine, so the =translate_to_<lang>= keys are sufficient. I have some =translate_<from>_<to>= keys set up for certain language pairs for when this doesn't quite work (I don't think I've ever needed them).

#+begin_src lua
  local wm=hs.webview.windowMasks
  Install:andUse("PopupTranslateSelection",
                 {
                   config = {
                     popup_style = wm.utility|wm.HUD|wm.titled|wm.closable|wm.resizable,
                   },
                   hotkeys = {
                     translate_to_en = { hyper, "e" },
                     translate_to_de = { hyper, "d" },
                     translate_to_es = { hyper, "s" },
                     translate_de_en = { shift_hyper, "e" },
                     translate_en_de = { shift_hyper, "d" },
                   }
                 }
  )
#+end_src

