content-org/zzamboni.org
*** Miscellaneous stuff

In my =init-local.lua= file I keep some experimental or private stuff that I don't want to publish in my main config.

#+begin_src lua
  local localstuff=loadfile(hs.configdir .. "/init-local.lua")
  if localstuff then
    localstuff()
  end
#+end_src

*** End-of-config animation

The [[http://www.hammerspoon.org/Spoons/FadeLogo.html][FadeLogo]] spoon simply shows an animation of the Hammerspoon logo to signal the end of the config load.

#+begin_src lua
  Install:andUse("FadeLogo",
                 {
                   config = {
                     default_run = 1.0,
                   },
                   start = true
                 }
  )
#+end_src

If you don't want to use FadeLogo, you can have a regular notification.

#+begin_src lua
  -- hs.notify.show("Welcome to Hammerspoon", "Have fun!", "")
#+end_src
