content/post/2018-01-08-my-hammerspoon-configuration-with-commentary.md


## Miscellaneous stuff {#miscellaneous-stuff}

In my `init-local.lua` file I keep some experimental or private stuff
that I don't want to publish in my main config.

```lua
local localstuff=loadfile(hs.configdir .. "/init-local.lua")
if localstuff then
  localstuff()
end
```


## End-of-config animation {#end-of-config-animation}

The [FadeLogo](http://www.hammerspoon.org/Spoons/FadeLogo.html) spoon simply shows an animation of the Hammerspoon logo
to signal the end of the config load.

```lua
Install:andUse("FadeLogo",
               {
                 config = {
                   default_run = 1.0,
                 },
                 start = true
               }
)
```

If you don't want to use FadeLogo, you can have a regular notification.

```lua
-- hs.notify.show("Welcome to Hammerspoon", "Have fun!", "")
```
